Tekla Open API Reference for Tekla Structures 2025
Enum<E>.ReadXml Method
[Missing <summary> documentation for "M:Tekla.Structures.Datatype.Enum`1.ReadXml(System.Xml.XmlReader)"]
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ReadXml(
	XmlReader reader
)
Public Sub ReadXml (
	reader As XmlReader
)
Parameters
reader
Type: System.Xml.XmlReader
[Missing <param name="reader"/> documentation for "M:Tekla.Structures.Datatype.Enum`1.ReadXml(System.Xml.XmlReader)"]
Implements
IXmlSerializable.ReadXml(XmlReader)
See Also
Reference
Enum<E> Structure
Tekla.Structures.Datatype Namespace